import org.chess.GeneralChess;
import junit.framework.TestCase;
public class TestGeneralChess extends TestCase{
	GeneralChess chess=new GeneralChess();
	
	//黑将向左移动一格
	public void testCheck1(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 5, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 0,4,0,3, true);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//黑将向左移动2格(错误)
	public void testCheck2(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 5, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 0,4,0,2, true);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	
	//黑将向右移动1格
	public void testCheck3(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 5, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 0,4,0,5, true);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//黑将向右移动2格(错误)
	public void testCheck4(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 5, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 0,4,0,6, true);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	
	//黑将向下移动1格
	public void testCheck5(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 5, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 0,4,1,4, true);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//黑将向下移动2格(错误)
	public void testCheck6(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 5, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 0,4,2,4, true);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	
	//黑将向左下斜着1格(错误)
	public void testCheck7(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 5, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 0,4,1,3, true);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	
	//红帅向左移动一格
	public void testCheck8(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 5, 0, 0 }
		};
		boolean b = chess.check(map, 9,4,9,3, false);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//红帅向上移动一格
	public void testCheck9(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 5, 0, 0 }
		};
		boolean b = chess.check(map, 9,4,8,4, false);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//红帅向上移动2格   错误
	public void testCheck10(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 5, 0, 0 }
		};
		boolean b = chess.check(map, 9,4,7,4, false);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	
	//红帅向斜线   错误
	public void testCheck11(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 5, 0, 0 }
		};
		boolean b = chess.check(map, 9,4,8,3, false);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	
	
	
	

}
