import org.chess.ChapChess;
import junit.framework.TestCase;
public class TestChapChess extends TestCase {
	ChapChess chess = new ChapChess();
	
	//黑士向左上移动
	public void testCheck1(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
				
		};
		boolean b = chess.check(map, 1,4,0,3, true);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//黑士向右上移动
	public void testCheck2(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
				
		};
		boolean b = chess.check(map, 1,4,0,5, true);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//黑士向左下移动
	public void testCheck3(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
				
		};
		boolean b = chess.check(map, 1,4,2,3, true);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//黑士向右下移动
	public void testCheck4(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
				
		};
		boolean b = chess.check(map, 1,4,2,5, true);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//黑士向下移动1格（错误） 
	public void testCheck5(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
				
		};
		boolean b = chess.check(map, 1,4,2,4, true);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	//黑士向下移动2格（错误） 
	public void testCheck6(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
				
		};
		boolean b = chess.check(map, 1,4,3,4, true);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	
	//红仕向左上移动
	public void testCheck11(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 8,4,7,3, false);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//红仕向右上移动
	public void testCheck12(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 8,4,7,5, false);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//红仕向左下移动
	public void testCheck13(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 8,4,9,3,false);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//红仕向右下移动
	public void testCheck14(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 8,4,9,5, false);//黑方还是红方， true为黑方
		assertEquals(b, true);
	}
	
	//红仕向上移动1格（错误）
	public void testCheck15(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 8,4,7,4, false);//黑方还是红方， true为黑方
		assertEquals(b,false);
	}
	
	//红仕向上移动2格（错误）
	public void testCheck16(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 }
		};
		boolean b = chess.check(map, 8,4,6,4, false);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}
	
	/*//红仕被堵（错误）
	public void testCheck17(){
		int[][] map = {//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 4, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },//2
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 0, 0, 0 },
				{ 0 ,0 ,0, 0, 1, 0, 0 },
				{ 0 ,0 ,0, 4, 0, 0, 0 }
		};
		boolean b = chess.check(map, 9,3,8,4, false);//黑方还是红方， true为黑方
		assertEquals(b, false);
	}*/

}
